app/controllers/students_controller.rb

SELECT `students`.* FROM `students`
---
  def index
    @students = Student.all

INSERT INTO `students` (`name`, `age`, `created_at`, `updated_at`) VALUES ('xyz', 20, '2017-07-25 04:55:54', '2017-07-25 04:55:54')
---
  def create
    @student = Student.new(student_params)

    if @student.save

UPDATE `students` SET `name` = 'danish', `updated_at` = '2017-07-25 05:04:30' WHERE `students`.`id` = 1
---
  def update
    if @student.update(student_params)

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
---
    def set_student
      @student = Student.find(params[:id])